import os
import random
a = [["Республика Адыгея", "Майкоп"], ["Республика Дагестан", "Махачкала"], ["Республика Ингушетия", "Магас"], ["Кабардино-Балкарская республика", "Нальчик"], ["Республика Калмыкия", "Элиста"], ["Карачаево-Черкесская республика", "Черкесск"], ["Республика Крым", "Симферопль"], ["Республика Марий Эл", "Йокшар-Ола"], ["Республика Мордовия", "Саранск"], ["Республика Северная осетия (Алания)", "Владикавказ"], ["Республика Татарстан", "Казань"], ["Удмуртская республика", "Ижевск"], ["Чеченская Республика", "Грозный"], ["Чувашская Республика - Чувашия", "Чебоксары"], ["Республика Хакасия", "Абакан"], ["Eврейская Автономная Oбласть", "Биробиджан"], ["Чукотский автономный округ", "Анадырь"], ["Камчатский край", "Петропаловск-камчатский"], ["Сахалинская область", "Южно-Сахалинск"], ["Приморский край", "Владивосток"], ["Амурская область", "Благовещенск" ], ["Забайкальский край", "Чита"], ["Республика Бурятия", "Улан-де"], ["Республика Тыва", "Кызыл"], ["Республика Алтай", "Горно-Алтайск"], ["Алтайский край", "Барнаул"], ["Ямало-Ненецкий автономный округ", "Салехард"], ["Ненецкий автономный округ", "Нарьян-Мар"], ["Республика Коми", "Сыктывкар"], ["Республика Карелия", "Петрозаводск"], ["Новгородская область", "Великий Новгород"], ["Свердловская область", "Екатеринбург"]]
type = input("Выбрать режим.. ")
if type == 'Поиск':
	while True:
		what = input()
		if 'стоп' in what:
			break
		for i in range(len(a)):
			print("Loading: " + str((i / len(a)-1)*100) + "%")
			if what in a[i][0]:
				qu = input(a[i][0] + '?')
				if 'да' in qu:
					print(a[i][1])
					input()
					os.system("clear")
					break
				else:
					continue
			os.system("clear")
if type == "Изучение":
	points = 0
	expo = list(range(0,len(a)))
	while len(expo) != 0:
		i = random.randint(0,len(expo)-1)
		print(a[expo[i]][0])
		st = input()
		if a[expo[i]][1] == st:
			points += 1
			print("OK")
			print("Баллов ", str(points))
			input()
		else:
			print("Не точно, проверь сам")
			print(a[expo[i]][1])
			l = input()
		expo.pop(i)
		input()
		os.system("clear")
	print(str(points) + '/31 баллов')
	if points > 28:
		print("Супер!")
	else:
		if points >  20:
			print("Не плохо")
		else:
			if points > 10:
				print("Плохо!")
			else:
				print("Ужасно!")
if type == "Показать все":
	for i in range(len(a)):
		print(str(a[i][0])+" "+str(a[i][1]))

new = input()
if new in "restart":
	os.system("python3 quizlet.py")

